src/cfe/КСП/Reports/КСП_СостояниеВыкупаДетальный2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>КСП_СостояниеВыкупаДетальный2</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/cfe/КСП/AccumulationRegisters/ЗаказыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказыКлиентов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заказано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОформлению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КПередаче</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/РаспределениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РаспределениеЗапасов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свободно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Зарезервировано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Обеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеОбеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОбеспечениюБезРезерва</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтложитьРезервирование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервироватьПоМереПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Резервировать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РаспределениеЗапасовСостояния</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказНаОтгрузку</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузка</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказНаПоступление</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемоеПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/AccumulationRegisters/РасчетыСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РасчетыСКлиентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Оплачивается</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/СостоянияЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияЗаказовКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроцентОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/Catalogs/Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Склады</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КСП_РозницаТипСклада</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСП_РозницаТипСклада</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСклада</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/Reports/КСП_СостояниеВыкупаДетальный2/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	//НастройкиКомпоновки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;  
    НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	Для Каждого эл Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(эл) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Переменная = 1;
		Иначе
			Если эл.Параметр = Новый ПараметрКомпоновкиДанных("Период") Тогда
				ДатаНачала = эл.Значение.ДатаНачала;
				ДатаОкончания = эл.Значение.ДатаОкончания;
			КонецЕсли;
			
			Если эл.Параметр = Новый ПараметрКомпоновкиДанных("СкладОТП") Тогда
				СкладОТП = эл.Значение;	
			КонецЕсли;
			
			Если эл.Параметр = Новый ПараметрКомпоновкиДанных("Клиент") Тогда
				Организация = эл.Значение;
			КонецЕсли;
	     КонецЕсли;
		
	КонецЦикла;   
	
	ТаблицаИсточник = ПолучениеТаблици(ДатаНачала, ДатаОкончания, СкладОТП, Организация);
	
	//Таблица = ТаблицаИсточник;
	
	//ТаблицаИсточник = МассивИсточник[14].Выгрузить();
	//Таблица.Свернуть("Договор,ВидДоговора,Магазин,ВидМагазина,ВариантЦены,ПризнакЗакрытияЗаказа", "ЗаказЗаказано_Сумма,ОтгрузкаОтгружено_Шт,ДолжнаБытьСуммаПредоплаты,НаличиеДСКлиента,СвободныеДСКлиента,ОтгруженоПоЗаявкеВЦенахЗаявки");
	
	ВнешнийНаборДанных = Новый Структура("ТаблицаДанных", ТаблицаИсточник);
	
	// НастройкиКомпоновки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(Новый ПараметрКомпоновкиДанных("Период"));
		
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки);
     
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных);
     
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);	
	
КонецПроцедуры

Функция ПолучениеТаблици(ДатаНачала, ДатаКонца, СкладОТП, Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
				|	ЗаказКлиентаТовары.Отменено КАК Отменено
				|ПОМЕСТИТЬ ЗакрытПоТЧСтрока
				|ИЗ
				|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
				|ГДЕ
				|	ЗаказКлиентаТовары.НомерСтроки = 1
				|	И ЗаказКлиентаТовары.Ссылка.Партнер = &Клиент2
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказКлиентаТовары.Отменено,
				|	ЗаказКлиентаТовары.Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ЗаказыКлиентов.ЗаказКлиента КАК Заказ,
				|	ВЫБОР
				|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Отменено) = 1
				|			ТОГДА ЗакрытПоТЧСтрока.Отменено
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК Отменено,
				|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Отменено) КАК НомерСтроки,
				|	ЗаказыКлиентов.Регистратор КАК Регистратор,
				|	СУММА(ВЫБОР
				|			КОГДА ЗаказКлиентаТовары.Отменено = ИСТИНА
				|				ТОГДА 0
				|			ИНАЧЕ ЗаказКлиентаТовары.Сумма
				|		КОНЕЦ) КАК СуммаОтменено,
				|	ЗаказКлиентаТовары.Ссылка КАК Ссылка
				|ПОМЕСТИТЬ закрытПоТЧ
				|ИЗ
				|	РегистрНакопления.ЗаказыКлиентов КАК ЗаказыКлиентов
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
				|			ЛЕВОЕ СОЕДИНЕНИЕ ЗакрытПоТЧСтрока КАК ЗакрытПоТЧСтрока
				|			ПО (ЗаказКлиентаТовары.Ссылка = ЗакрытПоТЧСтрока.Ссылка)
				|		ПО (ЗаказыКлиентов.Регистратор = ЗаказКлиентаТовары.Ссылка)
				|ГДЕ
				|	ЗаказКлиентаТовары.Ссылка.Партнер = &Клиент2
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказКлиентаТовары.Ссылка,
				|	ЗаказыКлиентов.ЗаказКлиента,
				|	ЗакрытПоТЧСтрока.Отменено,
				|	ЗаказыКлиентов.Регистратор
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ЗаказыКлиентов.ЗаказКлиента КАК Заказ,
				|	ВЫБОР
				|		КОГДА закрытПоТЧ.Отменено = ИСТИНА
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ВЫБОР
				|				КОГДА ПоступлениеБезналичныхДенежныхСредств.СуммаДокумента = ЗаказКлиентаТовары.Ссылка.СуммаДокумента - закрытПоТЧ.СуммаОтменено
				|						И РеализацияТоваровУслуг.СуммаДокумента = ЗаказКлиентаТовары.Ссылка.СуммаДокумента - закрытПоТЧ.СуммаОтменено
				|					ТОГДА ИСТИНА
				|				ИНАЧЕ ЛОЖЬ
				|			КОНЕЦ
				|	КОНЕЦ КАК ПризнакЗакрытияЗаказа,
				|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
				|	РеализацияТоваровУслуг.Номер КАК Номер
				|ПОМЕСТИТЬ закрыт
				|ИЗ
				|	РегистрНакопления.ЗаказыКлиентов КАК ЗаказыКлиентов
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
				|		ПО (ЗаказыКлиентов.Регистратор = ПоступлениеБезналичныхДенежныхСредств.ДокументОснование)
				|			И (ЗаказыКлиентов.ЗаказКлиента = ПоступлениеБезналичныхДенежныхСредств.ДокументОснование)
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				|		ПО (ЗаказыКлиентов.Регистратор = РеализацияТоваровУслуг.ЗаказКлиента)
				|			И (ЗаказыКлиентов.ЗаказКлиента = РеализацияТоваровУслуг.ЗаказКлиента)
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
				|		ПО (ЗаказыКлиентов.Регистратор = ЗаказКлиентаТовары.Ссылка)
				|			И (ЗаказыКлиентов.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка)
				|		ЛЕВОЕ СОЕДИНЕНИЕ закрытПоТЧ КАК закрытПоТЧ
				|		ПО (ЗаказыКлиентов.Регистратор = закрытПоТЧ.Заказ)
				|			И (ЗаказыКлиентов.ЗаказКлиента = закрытПоТЧ.Заказ)
				|ГДЕ
				|	ЗаказКлиентаТовары.Ссылка.Партнер = &Клиент2
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказыКлиентов.ЗаказКлиента,
				|	ПоступлениеБезналичныхДенежныхСредств.СуммаДокумента,
				|	ЗаказыКлиентов.Сумма,
				|	ВЫБОР
				|		КОГДА закрытПоТЧ.Отменено = ИСТИНА
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ВЫБОР
				|				КОГДА ПоступлениеБезналичныхДенежныхСредств.СуммаДокумента = ЗаказКлиентаТовары.Ссылка.СуммаДокумента - закрытПоТЧ.СуммаОтменено
				|						И РеализацияТоваровУслуг.СуммаДокумента = ЗаказКлиентаТовары.Ссылка.СуммаДокумента - закрытПоТЧ.СуммаОтменено
				|					ТОГДА ИСТИНА
				|				ИНАЧЕ ЛОЖЬ
				|			КОНЕЦ
				|	КОНЕЦ,
				|	РеализацияТоваровУслуг.Ссылка,
				|	РеализацияТоваровУслуг.Номер
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	СУММА(ЗаказыКлиентов.Сумма) КАК СуммаЗаявкиСУчётомКорректировки,
				|	СУММА(ЗаказыКлиентов.КОформлению / ВЫБОР
				|			КОГДА ЗаказыКлиентов.Заказано = 0
				|				ТОГДА 1
				|			ИНАЧЕ ЗаказыКлиентов.Заказано
				|		КОНЕЦ * 100) КАК ОтгруженоПоЗаявкеВЦенахЗаявки,
				|	СУММА(ЗаказыКлиентов.Сумма / 10) КАК ДолжнаБытьСуммаПредоплаты,
				|	СУММА(ЗаказыКлиентов.Заказано) КАК ЗаказЗаказано_Шт,
				|	СУММА(ЗаказыКлиентов.Сумма) КАК ЗаказЗаказано_Сумма,
				|	МАКСИМУМ(ЗаказыКлиентовОбороты.КОформлениюРасход) КАК ОтгрузкаОтгружено_Шт,
				|	СУММА(ЗаказыКлиентовОбороты.КОформлениюРасход) КАК ОтгрузкаОтгруженоСуммаВЦенахЗаявки,
				|	СУММА(ЗаказыКлиентов.КОформлению / ВЫБОР
				|			КОГДА ЗаказыКлиентов.Заказано = 0
				|				ТОГДА 1
				|			ИНАЧЕ ЗаказыКлиентов.Заказано
				|		КОНЕЦ * 100) КАК ОтгрузкаПроцентВыкупаВШт,
				|	СРЕДНЕЕ(ЗаказыКлиентовОбороты.КОформлениюПриход) КАК РезервРезервШт,
				|	СУММА(ЗаказыКлиентовОбороты.КОформлениюПриход * (ЗаказыКлиентов.Сумма / ВЫБОР
				|			КОГДА ЗаказыКлиентов.Заказано = 0
				|				ТОГДА 1
				|			ИНАЧЕ ЗаказыКлиентов.Заказано
				|		КОНЕЦ)) КАК РезервРезервСумма,
				|	ЗаказыКлиентов.Номенклатура КАК Номенклатура,
				|	ЗаказыКлиентов.Характеристика КАК Характеристика,
				|	ЗаказыКлиентов.Склад КАК Склад,
				|	ЗаказыКлиентов.ЗаказКлиента КАК ЗаказКлиента,
				|	ЗаказыКлиентов.ЗаказКлиента.Номер КАК ЗаказКлиентаНомер,
				|	СУММА(ЗаказыКлиентовОбороты.КОформлениюРасход) КАК КОформлениюРасход,
				|	МИНИМУМ(ЗаказыКлиентовОбороты.КОформлениюПриход + ЗаказыКлиентов.КОформлению) КАК ОтгрузкаИРезервШт,
				|	ЗаказыКлиентов.ЗаказКлиента.КСП_Коллекция.ДатаНачалаПродаж КАК ЗаказКлиентаКСП_КоллекцияДатаНачалаПродаж,
				|	ЗаказыКлиентов.ЗаказКлиента.КСП_Коллекция.ДатаЗапретаПродажи КАК ЗаказКлиентаКСП_КоллекцияДатаЗапретаПродажи,
				|	ЗаказыКлиентов.Номенклатура.КСП_АртикулУПП.Капсула.ПериодВывески КАК ПериодВывески
				|ПОМЕСТИТЬ РНЗаказы
				|ИЗ
				|	РегистрНакопления.ЗаказыКлиентов КАК ЗаказыКлиентов
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыКлиентов.Обороты КАК ЗаказыКлиентовОбороты
				|		ПО (ЗаказыКлиентов.ЗаказКлиента = ЗаказыКлиентовОбороты.ЗаказКлиента)
				|			И (ЗаказыКлиентов.Номенклатура = ЗаказыКлиентовОбороты.Номенклатура)
				|			И (ЗаказыКлиентов.Характеристика = ЗаказыКлиентовОбороты.Характеристика)
				|			И (ЗаказыКлиентов.Склад = ЗаказыКлиентовОбороты.Склад)
				|			И (ЗаказыКлиентов.КодСтроки = ЗаказыКлиентовОбороты.КодСтроки)
				|			И (ЗаказыКлиентов.Серия = ЗаказыКлиентовОбороты.Серия)
				|ГДЕ
				|	ЗаказыКлиентов.Период МЕЖДУ &НачалоПериода2 И &КонецПериода2
				|	И ЗаказыКлиентов.Регистратор = ЗаказыКлиентов.ЗаказКлиента
				|	И ЗаказыКлиентов.ЗаказКлиента.Партнер = &Клиент2
				|	И ЗаказыКлиентов.Номенклатура <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказыКлиентов.Номенклатура,
				|	ЗаказыКлиентов.Характеристика,
				|	ЗаказыКлиентов.Склад,
				|	ЗаказыКлиентов.ЗаказКлиента,
				|	ЗаказыКлиентов.ЗаказКлиента.Номер,
				|	ЗаказыКлиентов.ЗаказКлиента.КСП_Коллекция.ДатаНачалаПродаж,
				|	ЗаказыКлиентов.ЗаказКлиента.КСП_Коллекция.ДатаЗапретаПродажи,
				|	ЗаказыКлиентов.Номенклатура.КСП_АртикулУПП.Капсула.ПериодВывески
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ЗаказыКлиентов.Номенклатура КАК Номенклатура,
				|	ЗаказыКлиентов.Характеристика КАК Характеристика,
				|	ЗаказыКлиентов.Склад КАК Склад,
				|	ЗаказыКлиентов.ЗаказКлиента КАК ЗаказКлиента,
				|	ЗаказыКлиентов.КодСтроки КАК КодСтроки,
				|	ЗаказыКлиентов.Период КАК Период,
				|	ЗаказыКлиентов.КОформлению КАК КОформлению,
				|	ЗаказыКлиентов.Номенклатура.КСП_АртикулУПП.Капсула.ПериодВывески КАК НоменклатураКСП_АртикулУППКапсулаПериодВывески
				|ПОМЕСТИТЬ РезервыПоДатам
				|ИЗ
				|	РегистрНакопления.ЗаказыКлиентов КАК ЗаказыКлиентов
				|ГДЕ
				|	ЗаказыКлиентов.Период МЕЖДУ &НачалоПериода2 И &КонецПериода2
				|	И ЗаказыКлиентов.Регистратор = ЗаказыКлиентов.ЗаказКлиента
				|	И ЗаказыКлиентов.ЗаказКлиента.Партнер = &Клиент2
				|	И ЗаказыКлиентов.Заказано = 0
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ЗаказыКлиентов.ЗаказКлиента КАК ЗаказКлиента,
				|	ЗаказыКлиентов.Период КАК Период,
				|	СУММА(ЗаказыКлиентов.КОформлению) КАК КОформлению
				|ПОМЕСТИТЬ Запасы
				|ИЗ
				|	РегистрНакопления.ЗаказыКлиентов КАК ЗаказыКлиентов
				|ГДЕ
				|	ЗаказыКлиентов.Период МЕЖДУ &НачалоПериода2 И &КонецПериода2
				|	И ЗаказыКлиентов.ЗаказКлиента.Партнер = &Клиент2
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказыКлиентов.ЗаказКлиента,
				|	ЗаказыКлиентов.Период
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
				|	РаспределениеЗапасов.Характеристика КАК Характеристика,
				|	СУММА(РаспределениеЗапасов.Свободно) КАК Свободно,
				|	СУММА(РаспределениеЗапасов.Резерв) КАК Резерв,
				|	РаспределениеЗапасов.Номенклатура.КСП_АртикулУПП.Капсула.ПериодВывески КАК НоменклатураКСП_АртикулУППКапсулаПериодВывески
				|ПОМЕСТИТЬ ЗапасыОБ
				|ИЗ
				|	РНЗаказы КАК РНЗаказы
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
				|		ПО (РНЗаказы.Номенклатура = РаспределениеЗапасов.Номенклатура)
				|			И (РНЗаказы.Характеристика = РаспределениеЗапасов.Характеристика)
				|
				|СГРУППИРОВАТЬ ПО
				|	РаспределениеЗапасов.Номенклатура,
				|	РаспределениеЗапасов.Характеристика,
				|	РаспределениеЗапасов.Номенклатура.КСП_АртикулУПП.Капсула.ПериодВывески
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
				|	РаспределениеЗапасов.Характеристика КАК Характеристика,
				|	МИНИМУМ(РаспределениеЗапасов.Свободно) КАК Свободно,
				|	СУММА(РаспределениеЗапасов.Резерв) КАК Резерв,
				|	РаспределениеЗапасов.Номенклатура.КСП_АртикулУПП.Капсула.ПериодВывески КАК НоменклатураКСП_АртикулУППКапсулаПериодВывески
				|ПОМЕСТИТЬ ЗапасыСоСкладами
				|ИЗ
				|	РНЗаказы КАК РНЗаказы
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
				|		ПО (РНЗаказы.Номенклатура = РаспределениеЗапасов.Номенклатура)
				|			И (РНЗаказы.Характеристика = РаспределениеЗапасов.Характеристика)
				|ГДЕ
				|	РаспределениеЗапасов.Склад = &СкладОТП2
				|
				|СГРУППИРОВАТЬ ПО
				|	РаспределениеЗапасов.Номенклатура,
				|	РаспределениеЗапасов.Характеристика,
				|	РаспределениеЗапасов.Номенклатура.КСП_АртикулУПП.Капсула.ПериодВывески
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	МАКСИМУМ(РасчетыСКлиентамиОстаткиИОбороты.СуммаРасход) КАК НаличиеДСКлиента,
				|	МАКСИМУМ(РасчетыСКлиентамиОстаткиИОбороты.СуммаКонечныйОстаток) КАК СвободныеДСКлиента,
				|	РасчетыСКлиентамиОстаткиИОбороты.ОбъектРасчетов.Объект КАК ОбъектРасчетовОбъект
				|ПОМЕСТИТЬ РНРасчёты
				|ИЗ
				|	РегистрНакопления.РасчетыСКлиентами.ОстаткиИОбороты(&НачалоПериода2, &КонецПериода2, , , ) КАК РасчетыСКлиентамиОстаткиИОбороты
				|
				|СГРУППИРОВАТЬ ПО
				|	РасчетыСКлиентамиОстаткиИОбороты.ОбъектРасчетов.Объект
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	СостоянияЗаказовКлиентов.Заказ КАК Заказ,
				|	СостоянияЗаказовКлиентов.Состояние КАК Состояние,
				|	СостоянияЗаказовКлиентов.Состояние.Ссылка КАК СостояниеСсылка,
				|	СостоянияЗаказовКлиентов.Состояние.Порядок КАК СостояниеПорядок
				|ПОМЕСТИТЬ СостоянияЗаказов
				|ИЗ
				|	РНЗаказы КАК РНЗаказы
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
				|		ПО (РНЗаказы.ЗаказКлиента = СостоянияЗаказовКлиентов.Заказ)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ЗаказКлиентаТовары.Ссылка.Статус КАК Статус,
				|	ЗаказКлиентаТовары.Ссылка.Партнер.Наименование КАК Клиент,
				|	ЗаказКлиентаТовары.Ссылка.Подразделение.Наименование КАК ОТП,
				|	ЗаказКлиентаТовары.Ссылка.Партнер.БизнесРегион КАК Субрегион,
				|	ЗаказКлиентаТовары.Ссылка.Соглашение КАК Договор,
				|	ЗаказКлиентаТовары.Ссылка.Соглашение.Наименование КАК ВидДоговора,
				|	ЗаказКлиентаТовары.Ссылка.Склад КАК Магазин,
				|	ЗаказКлиентаТовары.Склад.Родитель КАК ВидМагазина,
				|	ЗаказКлиентаТовары.Ссылка.Соглашение.ИндивидуальныйВидЦены КАК ВариантЦены,
				|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
				|	ЗаказКлиентаТовары.Номенклатура.КСП_АртикулУПП.Капсула.ПериодВывески КАК НоменклатураКСП_АртикулУППКапсулаПериодВывески
				|ПОМЕСТИТЬ ТЧЗаказовТовары
				|ИЗ
				|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
				|ГДЕ
				|	ЗаказКлиентаТовары.Ссылка.Партнер = &Клиент2
				|	И ЗаказКлиентаТовары.Номенклатура <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказКлиентаТовары.Склад.Родитель,
				|	ЗаказКлиентаТовары.Ссылка,
				|	ЗаказКлиентаТовары.Ссылка.Статус,
				|	ЗаказКлиентаТовары.Ссылка.Партнер.Наименование,
				|	ЗаказКлиентаТовары.Ссылка.Партнер.БизнесРегион,
				|	ЗаказКлиентаТовары.Ссылка.Соглашение,
				|	ЗаказКлиентаТовары.Ссылка.Соглашение.Наименование,
				|	ЗаказКлиентаТовары.Ссылка.Склад,
				|	ЗаказКлиентаТовары.Ссылка.Соглашение.ИндивидуальныйВидЦены,
				|	ЗаказКлиентаТовары.Ссылка.Подразделение.Наименование,
				|	ЗаказКлиентаТовары.Номенклатура.КСП_АртикулУПП.Капсула.ПериодВывески
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ТЧЗаказовТовары.Клиент КАК Клиент,
				|	ТЧЗаказовТовары.ОТП КАК ОТП,
				|	ТЧЗаказовТовары.Субрегион КАК Субрегион,
				|	ТЧЗаказовТовары.Договор КАК Договор,
				|	ТЧЗаказовТовары.ВидДоговора КАК ВидДоговора,
				|	ТЧЗаказовТовары.Магазин КАК Магазин,
				|	ТЧЗаказовТовары.ВидМагазина КАК ВидМагазина,
				|	ТЧЗаказовТовары.ВариантЦены КАК ВариантЦены,
				|	РНЗаказы.СуммаЗаявкиСУчётомКорректировки КАК СуммаЗаявкиСУчётомКорректировки,
				|	РНЗаказы.РезервРезервСумма КАК ОтгруженоПоЗаявкеВЦенахЗаявки,
				|	РНЗаказы.ДолжнаБытьСуммаПредоплаты КАК ДолжнаБытьСуммаПредоплаты,
				|	РНРасчёты.НаличиеДСКлиента КАК НаличиеДСКлиента,
				|	РНРасчёты.СвободныеДСКлиента КАК СвободныеДСКлиента,
				|	ВЫБОР
				|		КОГДА СостоянияЗаказов.СостояниеПорядок = 9
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК ПризнакЗакрытияЗаказа,
				|	СТРОКА(РНЗаказы.ЗаказКлиентаКСП_КоллекцияДатаНачалаПродаж) + "" - "" + СТРОКА(РНЗаказы.ЗаказКлиентаКСП_КоллекцияДатаЗапретаПродажи) КАК ПериодВывески,
				|	РНЗаказы.ЗаказЗаказано_Шт КАК ЗаказЗаказано_Шт,
				|	РНЗаказы.ЗаказЗаказано_Сумма КАК ЗаказЗаказано_Сумма,
				|	РНЗаказы.ОтгрузкаОтгружено_Шт КАК ОтгрузкаОтгружено_Шт,
				|	РНЗаказы.ОтгрузкаОтгружено_Шт * РНЗаказы.ЗаказЗаказано_Сумма / ВЫБОР
				|		КОГДА РНЗаказы.ЗаказЗаказано_Шт = 0
				|			ТОГДА 1
				|		ИНАЧЕ РНЗаказы.ЗаказЗаказано_Шт
				|	КОНЕЦ КАК ОтгрузкаОтгруженоСуммаВЦенахЗаявки,
				|	РНЗаказы.ОтгрузкаОтгружено_Шт / ВЫБОР
				|		КОГДА РНЗаказы.ЗаказЗаказано_Шт = 0
				|			ТОГДА 1
				|		ИНАЧЕ РНЗаказы.ЗаказЗаказано_Шт
				|	КОНЕЦ КАК ОтгрузкаПроцентВыкупаВШт,
				|	РНЗаказы.ОтгрузкаИРезервШт КАК ОтгрузкаИРезервШТ,
				|	РНЗаказы.ОтгрузкаИРезервШт / ВЫБОР
				|		КОГДА РНЗаказы.ЗаказЗаказано_Шт = 0
				|			ТОГДА 1
				|		ИНАЧЕ РНЗаказы.ЗаказЗаказано_Шт
				|	КОНЕЦ КАК ПроцентОтгрузкиИРезерваШтук,
				|	РНЗаказы.РезервРезервШт КАК РезервРезервШт,
				|	РНЗаказы.РезервРезервСумма КАК РезервРезервСумма,
				|	ЗапасыСоСкладами.Свободно КАК СвободныйОстатокНаСкладеОТПДляЗакрытияПотребностиШт,
				|	ЗапасыСоСкладами.Свободно * (РНЗаказы.СуммаЗаявкиСУчётомКорректировки / ВЫБОР
				|		КОГДА РНЗаказы.ЗаказЗаказано_Шт = 0
				|			ТОГДА 1
				|		ИНАЧЕ РНЗаказы.ЗаказЗаказано_Шт
				|	КОНЕЦ) КАК СвободныйОстатокНаСкладеОТПДляЗакрытияПотребностиСумма,
				|	РНЗаказы.ЗаказКлиентаНомер КАК СсылкаНомер,
				|	РезервыПоДатам.Период КАК ДатаПоступления,
				|	Запасы.КОформлению КАК Резерв,
				|	ТЧЗаказовТовары.Ссылка КАК Ссылка,
				|	РНЗаказы.ОтгрузкаОтгружено_Шт / ВЫБОР
				|		КОГДА РНЗаказы.ЗаказЗаказано_Шт = 0
				|			ТОГДА 1
				|		ИНАЧЕ РНЗаказы.ЗаказЗаказано_Шт
				|	КОНЕЦ * 100 КАК ПроцентОтгруженоПоЗаявкеВЦенахЗаявки,
				|	ЗапасыОБ.Свободно КАК Свободно,
				|	РНЗаказы.Характеристика КАК Характеристика,
				|	РНЗаказы.ПериодВывески КАК ПериодВывески1
				|ПОМЕСТИТЬ ПРЕДФИНАЛ
				|ИЗ
				|	РНЗаказы КАК РНЗаказы
				|		ЛЕВОЕ СОЕДИНЕНИЕ закрытПоТЧ КАК закрытПоТЧ
				|		ПО (РНЗаказы.ЗаказКлиента = закрытПоТЧ.Ссылка)
				|		ЛЕВОЕ СОЕДИНЕНИЕ ЗакрытПоТЧСтрока КАК ЗакрытПоТЧСтрока
				|		ПО (РНЗаказы.ЗаказКлиента = ЗакрытПоТЧСтрока.Ссылка)
				|		ЛЕВОЕ СОЕДИНЕНИЕ закрыт КАК закрыт
				|		ПО (РНЗаказы.ЗаказКлиента = закрыт.Ссылка)
				|		ЛЕВОЕ СОЕДИНЕНИЕ РезервыПоДатам КАК РезервыПоДатам
				|		ПО (РНЗаказы.Склад = РезервыПоДатам.Склад)
				|			И (РНЗаказы.Номенклатура = РезервыПоДатам.Номенклатура)
				|			И (РНЗаказы.Характеристика = РезервыПоДатам.Характеристика)
				|			И (РНЗаказы.ЗаказКлиента = РезервыПоДатам.ЗаказКлиента)
				|			И (РНЗаказы.ПериодВывески = РезервыПоДатам.НоменклатураКСП_АртикулУППКапсулаПериодВывески)
				|		ЛЕВОЕ СОЕДИНЕНИЕ СостоянияЗаказов КАК СостоянияЗаказов
				|		ПО (РНЗаказы.ЗаказКлиента = СостоянияЗаказов.Заказ)
				|		ЛЕВОЕ СОЕДИНЕНИЕ РНРасчёты КАК РНРасчёты
				|		ПО (РНЗаказы.ЗаказКлиента = РНРасчёты.ОбъектРасчетовОбъект)
				|		ЛЕВОЕ СОЕДИНЕНИЕ ЗапасыСоСкладами КАК ЗапасыСоСкладами
				|		ПО (РНЗаказы.Номенклатура = ЗапасыСоСкладами.Номенклатура)
				|			И (РНЗаказы.Характеристика = ЗапасыСоСкладами.Характеристика)
				|			И (РНЗаказы.ПериодВывески = ЗапасыСоСкладами.НоменклатураКСП_АртикулУППКапсулаПериодВывески)
				|		ЛЕВОЕ СОЕДИНЕНИЕ ТЧЗаказовТовары КАК ТЧЗаказовТовары
				|		ПО (РНЗаказы.ЗаказКлиента = ТЧЗаказовТовары.Ссылка)
				|		ЛЕВОЕ СОЕДИНЕНИЕ Запасы КАК Запасы
				|		ПО (РНЗаказы.ЗаказКлиента = Запасы.ЗаказКлиента)
				|			И (РезервыПоДатам.Период = Запасы.Период)
				|		ЛЕВОЕ СОЕДИНЕНИЕ ЗапасыОБ КАК ЗапасыОБ
				|		ПО (РНЗаказы.Номенклатура = ЗапасыОБ.Номенклатура)
				|			И (РНЗаказы.Характеристика = ЗапасыОБ.Характеристика)
				|			И (РНЗаказы.ПериодВывески = ЗапасыОБ.НоменклатураКСП_АртикулУППКапсулаПериодВывески)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ПРЕДФИНАЛ.Клиент КАК Клиент,
				|	ПРЕДФИНАЛ.ОТП КАК ОТП,
				|	ПРЕДФИНАЛ.Субрегион КАК Субрегион,
				|	ПРЕДФИНАЛ.Договор КАК Договор,
				|	ПРЕДФИНАЛ.ВидДоговора КАК ВидДоговора,
				|	ПРЕДФИНАЛ.Магазин КАК Магазин,
				|	ПРЕДФИНАЛ.ВидМагазина КАК ВидМагазина,
				|	ПРЕДФИНАЛ.ВариантЦены КАК ВариантЦены,
				|	СУММА(ПРЕДФИНАЛ.СуммаЗаявкиСУчётомКорректировки) КАК СуммаЗаявкиСУчётомКорректировки,
				|	СУММА(ПРЕДФИНАЛ.ОтгруженоПоЗаявкеВЦенахЗаявки) КАК ОтгруженоПоЗаявкеВЦенахЗаявки,
				|	СУММА(ПРЕДФИНАЛ.ДолжнаБытьСуммаПредоплаты) КАК ДолжнаБытьСуммаПредоплаты,
				|	СРЕДНЕЕ(ПРЕДФИНАЛ.НаличиеДСКлиента) КАК НаличиеДСКлиента,
				|	СРЕДНЕЕ(ПРЕДФИНАЛ.СвободныеДСКлиента) КАК СвободныеДСКлиента,
				|	ПРЕДФИНАЛ.ПризнакЗакрытияЗаказа КАК ПризнакЗакрытияЗаказа,
				|	СУММА(ПРЕДФИНАЛ.ЗаказЗаказано_Шт) КАК ЗаказЗаказано_Шт,
				|	СУММА(ПРЕДФИНАЛ.ЗаказЗаказано_Сумма) КАК ЗаказЗаказано_Сумма,
				|	СУММА(ПРЕДФИНАЛ.ОтгрузкаОтгружено_Шт) КАК ОтгрузкаОтгружено_Шт,
				|	СУММА(ПРЕДФИНАЛ.ОтгрузкаОтгруженоСуммаВЦенахЗаявки) КАК ОтгрузкаОтгруженоСуммаВЦенахЗаявки,
				|	СУММА(ПРЕДФИНАЛ.ОтгрузкаПроцентВыкупаВШт / ВЫБОР
				|			КОГДА ПРЕДФИНАЛ.ЗаказЗаказано_Шт = 0
				|				ТОГДА 1
				|			ИНАЧЕ ПРЕДФИНАЛ.ЗаказЗаказано_Шт
				|		КОНЕЦ * 100) КАК ОтгрузкаПроцентВыкупаВШт,
				|	СУММА(ПРЕДФИНАЛ.ОтгрузкаИРезервШТ) КАК ОтгрузкаИРезервШТ,
				|	СУММА(ПРЕДФИНАЛ.ОтгрузкаИРезервШТ / ВЫБОР
				|			КОГДА ПРЕДФИНАЛ.ЗаказЗаказано_Шт = 0
				|				ТОГДА 1
				|			ИНАЧЕ ПРЕДФИНАЛ.ЗаказЗаказано_Шт
				|		КОНЕЦ * 100) КАК ПроцентОтгрузкиИРезерваШтук,
				|	СУММА(ПРЕДФИНАЛ.РезервРезервШт) КАК РезервРезервШт,
				|	СУММА(ПРЕДФИНАЛ.РезервРезервСумма) КАК РезервРезервСумма,
				|	СУММА(ПРЕДФИНАЛ.СвободныйОстатокНаСкладеОТПДляЗакрытияПотребностиШт) КАК СвободныйОстатокНаСкладеОТПДляЗакрытияПотребностиШт,
				|	СУММА(ПРЕДФИНАЛ.СвободныйОстатокНаСкладеОТПДляЗакрытияПотребностиСумма) КАК СвободныйОстатокНаСкладеОТПДляЗакрытияПотребностиСумма,
				|	ПРЕДФИНАЛ.СсылкаНомер КАК СсылкаНомер,
				|	МИНИМУМ(ПРЕДФИНАЛ.ДатаПоступления) КАК ДатаПоступления,
				|	СУММА(ПРЕДФИНАЛ.Резерв) КАК Резерв,
				|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
				|			КОГДА ПРЕДФИНАЛ.ОтгрузкаОтгружено_Шт / ВЫБОР
				|					КОГДА ПРЕДФИНАЛ.ЗаказЗаказано_Шт = 0
				|						ТОГДА 1
				|					ИНАЧЕ ПРЕДФИНАЛ.ЗаказЗаказано_Шт
				|				КОНЕЦ * 100 = 0
				|				ТОГДА ""0""
				|			ИНАЧЕ ПРЕДФИНАЛ.ОтгрузкаОтгружено_Шт / ВЫБОР
				|					КОГДА ПРЕДФИНАЛ.ЗаказЗаказано_Шт = 0
				|						ТОГДА 1
				|					ИНАЧЕ ПРЕДФИНАЛ.ЗаказЗаказано_Шт
				|				КОНЕЦ * 100
				|		КОНЕЦ) КАК ПроцентОтгруженоПоЗаявкеВЦенахЗаявки,
				|	ПРЕДФИНАЛ.Ссылка КАК Ссылка,
				|	СУММА(ПРЕДФИНАЛ.Свободно) КАК Свободно,
				|	ПРЕДФИНАЛ.ПериодВывески КАК ПериодВывески,
				|	ПРЕДФИНАЛ.ПериодВывески1 КАК ПериодВывески1
				|ПОМЕСТИТЬ ПочтиФин
				|ИЗ
				|	ПРЕДФИНАЛ КАК ПРЕДФИНАЛ
				|ГДЕ
				|	ПРЕДФИНАЛ.СуммаЗаявкиСУчётомКорректировки > 0
				|
				|СГРУППИРОВАТЬ ПО
				|	ПРЕДФИНАЛ.Клиент,
				|	ПРЕДФИНАЛ.ОТП,
				|	ПРЕДФИНАЛ.Субрегион,
				|	ПРЕДФИНАЛ.Договор,
				|	ПРЕДФИНАЛ.ВидДоговора,
				|	ПРЕДФИНАЛ.Магазин,
				|	ПРЕДФИНАЛ.ВидМагазина,
				|	ПРЕДФИНАЛ.ВариантЦены,
				|	ПРЕДФИНАЛ.ПризнакЗакрытияЗаказа,
				|	ПРЕДФИНАЛ.СсылкаНомер,
				|	ПРЕДФИНАЛ.Ссылка,
				|	ПРЕДФИНАЛ.ПериодВывески,
				|	ПРЕДФИНАЛ.ПериодВывески1
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПочтиФин.НаличиеДСКлиента КАК НаличиеДСКлиента,
				|	-ПочтиФин.СвободныеДСКлиента КАК СвободныеДСКлиента,
				|	ПочтиФин.СвободныйОстатокНаСкладеОТПДляЗакрытияПотребностиШт КАК СвободныйОстатокНаСкладеОТПДляЗакрытияПотребностиШт,
				|	ПочтиФин.СвободныйОстатокНаСкладеОТПДляЗакрытияПотребностиСумма КАК СвободныйОстатокНаСкладеОТПДляЗакрытияПотребностиСумма,
				|	ПочтиФин.Свободно КАК СвободныйОстатокНаВсехСкладахОБДляЗакрытияПотребностиШТ,
				|	Запасы.КОформлению КАК Резерв,
				|	ПочтиФин.ПризнакЗакрытияЗаказа КАК ПризнакЗакрытияЗаказа,
				|	ПочтиФин.Клиент КАК Клиент,
				|	ПочтиФин.ОТП КАК ОТП,
				|	ПочтиФин.Субрегион КАК Субрегион,
				|	ПочтиФин.Договор КАК Договор,
				|	ПочтиФин.ВидДоговора КАК ВидДоговора,
				|	ПочтиФин.Магазин КАК Магазин,
				|	ЕСТЬNULL(ПочтиФин.ВидМагазина, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК ВидМагазина,
				|	ПочтиФин.ВариантЦены КАК ВариантЦены,
				|	ПочтиФин.СуммаЗаявкиСУчётомКорректировки КАК СуммаЗаявкиСУчётомКорректировки,
				|	ПочтиФин.РезервРезервСумма КАК ОтгруженоПоЗаявкеВЦенахЗаявки,
				|	ПочтиФин.ДолжнаБытьСуммаПредоплаты КАК ДолжнаБытьСуммаПредоплаты,
				|	ПочтиФин.СсылкаНомер КАК СсылкаНомер,
				|	ПочтиФин.ЗаказЗаказано_Шт КАК ЗаказЗаказано_Шт,
				|	ПочтиФин.ЗаказЗаказано_Сумма КАК ЗаказЗаказано_Сумма,
				|	ПочтиФин.ОтгрузкаОтгружено_Шт КАК ОтгрузкаОтгружено_Шт,
				|	ПочтиФин.ОтгрузкаОтгруженоСуммаВЦенахЗаявки КАК ОтгрузкаОтгруженоСуммаВЦенахЗаявки,
				|	ПочтиФин.ОтгрузкаОтгружено_Шт / ВЫБОР
				|		КОГДА ПочтиФин.ЗаказЗаказано_Шт = 0
				|			ТОГДА 1
				|		ИНАЧЕ ПочтиФин.ЗаказЗаказано_Шт
				|	КОНЕЦ * 100 КАК ОтгрузкаПроцентВыкупаВШт,
				|	ПочтиФин.РезервРезервШт - ПочтиФин.ОтгрузкаОтгружено_Шт + ПочтиФин.ОтгрузкаОтгружено_Шт КАК ОтгрузкаИРезервШТ,
				|	(ПочтиФин.РезервРезервШт - ПочтиФин.ОтгрузкаОтгружено_Шт + ПочтиФин.ОтгрузкаОтгружено_Шт) / ВЫБОР
				|		КОГДА ПочтиФин.ЗаказЗаказано_Шт = 0
				|			ТОГДА 1
				|		ИНАЧЕ ПочтиФин.ЗаказЗаказано_Шт
				|	КОНЕЦ * 100 КАК ПроцентОтгрузкиИРезерваШтук,
				|	ПочтиФин.РезервРезервШт КАК РезервРезервШт,
				|	ПочтиФин.РезервРезервСумма КАК РезервРезервСумма,
				|	ПочтиФин.ДатаПоступления КАК ДатаПоступления,
				|	ПочтиФин.ОтгрузкаОтгружено_Шт / ПочтиФин.ЗаказЗаказано_Шт * 100 КАК ПроцентОтгруженоПоЗаявкеВЦенахЗаявки,
				|	ПочтиФин.ОтгрузкаОтгружено_Шт / ВЫБОР
				|		КОГДА ПочтиФин.ЗаказЗаказано_Шт = 0
				|			ТОГДА 1
				|		ИНАЧЕ ПочтиФин.ЗаказЗаказано_Шт
				|	КОНЕЦ * 100 КАК Поле1,
				|	ПочтиФин.ПериодВывески КАК ПериодВывески,
				|	ПочтиФин.ПериодВывески1 КАК ПериодВывески1
				|ИЗ
				|	ПочтиФин КАК ПочтиФин
				|		ЛЕВОЕ СОЕДИНЕНИЕ Запасы КАК Запасы
				|		ПО (ПочтиФин.Ссылка = Запасы.ЗаказКлиента)
				|			И (ПочтиФин.ДатаПоступления = Запасы.Период)";
	
	Запрос.УстановитьПараметр("СкладОТП2", СкладОТП);
	Запрос.УстановитьПараметр("Клиент2", Организация);
	Запрос.УстановитьПараметр("НачалоПериода2", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода2", КонецДня(ДатаКонца));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	
	Возврат РезультатЗапроса;
	
КонецФункции
